#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.ecs_task_execution_role_permissions: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0e11c22be6652feb6]
aws_eip.nat_1: Refreshing state... [id=eipalloc-0215f27ffc3eea569]
aws_eip.nat_2: Refreshing state... [id=eipalloc-03c5ccac9d910efef]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:cluster/main]
aws_efs_file_system.shared_storage: Refreshing state... [id=fs-04b2c7ac079f721da]
data.aws_iam_policy_document.ecs_task_execution_role_trust: Reading...
aws_service_discovery_http_namespace.interview_project: Refreshing state... [id=ns-os4u4zahbptsybf5]
data.aws_iam_policy_document.ecs_task_execution_role_permissions: Read complete after 0s [id=3015117179]
data.aws_iam_policy_document.ecs_task_execution_role_trust: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-task-execution-role]
aws_ecs_task_definition.reverse_proxy: Refreshing state... [id=reverse-proxy]
aws_subnet.reverse_proxy_2: Refreshing state... [id=subnet-098ab06c68e85b663]
aws_subnet.wordpress_1: Refreshing state... [id=subnet-08b38f8e1645f42a8]
aws_security_group.efs_sg: Refreshing state... [id=sg-0e105ec5475485528]
aws_internet_gateway.gw: Refreshing state... [id=igw-02874c62ddd12f2b2]
aws_security_group.aurora_sg: Refreshing state... [id=sg-0c8fd9f4c191cae7b]
aws_subnet.reverse_proxy_1: Refreshing state... [id=subnet-0f0ec713bdc10736f]
aws_subnet.public_1: Refreshing state... [id=subnet-0156145c26348594b]
aws_subnet.wordpress_2: Refreshing state... [id=subnet-0b0c211d7a3d2c98d]
aws_security_group.alb_sg: Refreshing state... [id=sg-0a6290d3b64e78b6f]
aws_lb_target_group.reverse_proxy_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:targetgroup/reverse-proxy-tg/7b987f22a92c387b]
aws_subnet.public_2: Refreshing state... [id=subnet-0f6c170a78cc56eb9]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-08a22d0286054a9b7]
aws_security_group.reverse_proxy_sg: Refreshing state... [id=sg-09f8b7e294865b560]
aws_route_table.private_1: Refreshing state... [id=rtb-0c43aee41a20c25ae]
aws_efs_mount_target.az_2: Refreshing state... [id=fsmt-0c099bb4894afed42]
aws_efs_mount_target.az_1: Refreshing state... [id=fsmt-09a9c40bff2b85ec6]
aws_db_subnet_group.wordpress: Refreshing state... [id=wordpress]
aws_route_table.igw: Refreshing state... [id=rtb-0e15214ab7dbb5e05]
aws_lb.reverse_proxy_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:loadbalancer/app/reverse-proxy-alb/3cd8bf9346b4b936]
aws_security_group.wordpress_sg: Refreshing state... [id=sg-050747821ccebd97e]
aws_ecs_service.reverse_proxy_service: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:service/main/reverse-proxy-service]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-03487738e28854975]
aws_route_table_association.reverse_proxy_private_1: Refreshing state... [id=rtbassoc-0b52a2ef13dbd7973]
aws_route_table_association.wordpress_private_1: Refreshing state... [id=rtbassoc-0839739d9b5f0a3cf]
aws_route_table_association.public_1_igw: Refreshing state... [id=rtbassoc-029b501026e32fa8a]
aws_route_table.private_2: Refreshing state... [id=rtb-091b5af14296e36ac]
aws_route_table_association.public_2_igw: Refreshing state... [id=rtbassoc-0a1aa6ff8bf8eeda2]
aws_appautoscaling_target.reverse_proxy_scaling_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:816069151329:cluster/main/reverse-proxy-service]
aws_route_table_association.wordpress_private_2: Refreshing state... [id=rtbassoc-0a04a46f6e4569e58]
aws_route_table_association.reverse_proxy_private_2: Refreshing state... [id=rtbassoc-0a45e7f0fbefbb85b]
aws_lb_listener.reverse_proxy_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816069151329:listener/app/reverse-proxy-alb/3cd8bf9346b4b936/0a0f6ee6b02eee3b]
aws_appautoscaling_policy.reverse_proxy_scale_up: Refreshing state... [id=reverse-proxy-scale-up]
aws_appautoscaling_policy.reverse_proxy_scale_down: Refreshing state... [id=reverse-proxy-scale-down]
aws_rds_cluster.wordpress: Refreshing state... [id=wordpress]
aws_rds_cluster_instance.aurora_instance_2: Refreshing state... [id=aurora-instance-2]
aws_ecs_task_definition.wordpress: Refreshing state... [id=wordpress]
aws_rds_cluster_instance.aurora_instance_1: Refreshing state... [id=aurora-instance-1]
aws_ecs_service.wordpress: Refreshing state... [id=arn:aws:ecs:us-east-1:816069151329:service/main/wordpress-service]
aws_appautoscaling_target.wordpress_scaling_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:816069151329:cluster/main/wordpress-service]
aws_appautoscaling_policy.wordpress_scale_up: Refreshing state... [id=wordpress-scale-up]
aws_appautoscaling_policy.wordpress_scale_down: Refreshing state... [id=wordpress-scale-down]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.interview_project will be created
  + resource "aws_cloudwatch_log_group" "interview_project" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/main/interview-project"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_stream.reverse_proxy will be created
  + resource "aws_cloudwatch_log_stream" "reverse_proxy" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/main/interview-project"
      + name           = "reverse-proxy"
    }

  # aws_cloudwatch_log_stream.wordpress will be created
  + resource "aws_cloudwatch_log_stream" "wordpress" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/ecs/main/interview-project"
      + name           = "wordpress"
    }

  # aws_ecs_service.reverse_proxy_service will be updated in-place
  ~ resource "aws_ecs_service" "reverse_proxy_service" {
        id                                 = "arn:aws:ecs:us-east-1:816069151329:service/main/reverse-proxy-service"
        name                               = "reverse-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069151329:task-definition/reverse-proxy:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.wordpress will be updated in-place
  ~ resource "aws_ecs_service" "wordpress" {
        id                                 = "arn:aws:ecs:us-east-1:816069151329:service/main/wordpress-service"
        name                               = "wordpress-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069151329:task-definition/wordpress:4" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.reverse_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "reverse_proxy" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069151329:task-definition/reverse-proxy:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069151329:task-definition/reverse-proxy" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-group         = "/ecs/reverse-proxy" -> "/ecs/main/interview-project"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                    name             = "reverse-proxy"
                  ~ portMappings     = [
                      ~ {
                            name          = "http"
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "reverse-proxy" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "shared-storage" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-04b2c7ac079f721da" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "shared-storage"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-04b2c7ac079f721da"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

  # aws_ecs_task_definition.wordpress must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069151329:task-definition/wordpress:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069151329:task-definition/wordpress" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "shared-storage" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-04b2c7ac079f721da" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "shared-storage"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-04b2c7ac079f721da"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

Plan: 5 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ravenoak, Action: `pull_request`, Working Directory: ``, Workflow: `Run Terraform`*